FoamProject/poiseuilleFlow/icoFoam_re1000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       106550;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       106575;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2175;
        startFace       106600;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2175;
        startFace       108775;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          108750;
        startFace       110950;
    }
)

// ************************************************************************* //
