FoamProject/poiseuilleFlow/icoFoam_re1000/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000; // Based on travel time for a fluid element through the domain, calculated as Ux/L, where UX is inlet speed and L is length of domain
deltaT          1.8; // Set to have CFL = 1 for fully developed flow

writeControl    timeStep;

writeInterval   1; 

purgeWrite      1; // Only interested in final solution, so no point in storing intermediate results

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

OptimisationSwitches
{
	fileHandler collated;
}

// ************************************************************************* //
